swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/cmsis/rtl8735b/lib/source/rom/rtl8735b_irq.c
/**************************************************************************//**
 * @file     rtl8735b_irq.c
 * @brief    This file implements the NVIC control functions.
 * @version  V1.00
 * @date     2021-01-07
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#include "cmsis.h"
#include "rtl8735b_symbns4s.h"
#include "otp_boot_cfg.h"
#include "rtl8735b_wdt.h"

#define SECTION_VECTOR_TEXT                 SECTION(".vector.text")
#define SECTION_INT_VECTOR_STUBS            SECTION(".rom.hal_vector.stubs")

#define SECTION_RAM_VECTOR_TABLE            SECTION(".ram_vector_table")
#define SECTION_USER_IRQ                    SECTION(".ram_user_irq_table")

#define SECTION_IRQ_RODATA                  SECTION(".rom.irq.rodata")
#define SECTION_IRQ_BSS                     SECTION(".rom.irq.bss")
#define SECTION_SYSSTART_BSS                SECTION(".sysstart.bss")

extern stdio_port_t _stdio_port;
extern uint32_t __Vectors;      // ROM Vector table
extern uint32_t __Vectors_NS;      // Initialed Vector table
extern hal_wdt_adapter_t pwdt_adapter;

extern void *_memset(void *dst0, int Val, size_t length);

extern void Reset_Handler(void);                            /* Reset Handler */
extern void HardFault_Handler(void);                        /* Hard Fault Handler */
extern void stdio_uart_port_init(void);
extern void efuse_life_cycle_state_read(uint8_t *pstate);

void _irq_enable(int32_t irqn);
void _irq_disable(int32_t irqn);
void _irq_set_vector(int32_t irqn, uint32_t vector);
uint32_t _irq_get_vector(int32_t irqn);
void _irq_set_priority(int32_t irqn, uint32_t priority);
uint32_t _irq_get_priority(int32_t irqn);
void _irq_set_pending(int32_t irqn);
uint32_t _irq_get_pending(int32_t irqn);
void _irq_clear_pending(int32_t irqn);
void _interrupt_enable(void);
void _interrupt_disable(void);
void stack_trace_back(uint32_t msp, uint32_t psp, uint32_t fault_lr, uint32_t trace_ns);

/**
* @addtogroup hal_rtl_irq IRQ
* @{
*/

/**
  * @brief The SRAM base interrupt vector table.
  *        The default interrupt vector table will be copy to this table at boot time.
  *        New interrupt vector will be registered to this table too.
  */
#if !defined (CONFIG_BUILD_NONSECURE)
SECTION_RAM_VECTOR_TABLE int_vector_t ram_vector_table[MAX_VECTOR_TABLE_NUM] __ALIGNED(256);
#else
extern int_vector_t ram_vector_table[MAX_VECTOR_TABLE_NUM];
#endif
/**
  * @brief The optional IRQ related API functions.
  *        The ROM code has a default API function for the IRQ control.
  *        But the OS may has its own API function to do the same thing.
  *        So use this pointer to hook an optional IRQ APIs.
  */
SECTION_IRQ_BSS static hal_irq_api_t *pirq_api_tbl;
SECTION_SYSSTART_BSS fault_handler_back_trace_t *pfault_back_trace;
#if defined(CONFIG_BUILD_SECURE) && (CONFIG_BUILD_SECURE == 1)
SECTION_SYSSTART_BSS fault_handler_back_trace_t *pfault_back_trace_ns;
#endif
/**
  * @brief The default IRQ control APIs.
  */
SECTION_IRQ_RODATA const hal_irq_api_t default_irq_api_func_tbl = {
	.irq_enable =  _irq_enable,
	.irq_disable = _irq_disable,
	.irq_set_vector = _irq_set_vector,
	.irq_get_vector = _irq_get_vector,
	.irq_set_priority = _irq_set_priority,
	.irq_get_priority = _irq_get_priority,
	.irq_set_pending = _irq_set_pending,
	.irq_get_pending = _irq_get_pending,
	.irq_clear_pending = _irq_clear_pending,
	.interrupt_enable = _interrupt_enable,
	.interrupt_disable = _interrupt_disable
};

/// @cond DOXYGEN_ROM_HAL_API

/**
 * @addtogroup hs_hal_irq_rom_func IRQ ROM APIs.
 * @ingroup hs_hal_irq
 * @{
 * @brief IRQ ROM APIs.
 * @details The user application(in RAM space) should not call these APIs directly.
 *          There is another RAM base of IRQ APIs is provided for the user application.
 */

/**
  * @brief The stubs functions table to exports IRQ HAL functions in ROM.
  */
SECTION_INT_VECTOR_STUBS const hal_int_vector_func_stubs_t hal_int_vector_stubs = {
	.ram_vector_table = ram_vector_table,
	.pirq_api_tbl = (hal_irq_api_t *) &default_irq_api_func_tbl,
	.ppbk_trace_hdl = &pfault_back_trace,
#if defined(CONFIG_BUILD_SECURE) && (CONFIG_BUILD_SECURE == 1)
	.ppbk_trace_hdl_ns = &pfault_back_trace_ns,
#endif

	.hal_vector_table_init = hal_rtl_vector_table_init,
	.hal_irq_api_init = hal_rtl_irq_api_init,
	.hal_irq_enable = hal_rtl_irq_enable,
	.hal_irq_disable = hal_rtl_irq_disable,
	.hal_irq_set_vector = hal_rtl_irq_set_vector,
	.hal_irq_get_vector = hal_rtl_irq_get_vector,
	.hal_irq_set_priority = hal_rtl_irq_set_priority,
	.hal_irq_get_priority = hal_rtl_irq_get_priority,
	.hal_irq_set_pending = hal_rtl_irq_set_pending,
	.hal_irq_get_pending = hal_rtl_irq_get_pending,
	.hal_irq_clear_pending = hal_rtl_irq_clear_pending,
	.hal_irq_unreg = hal_rtl_irq_unreg
};

/**
 *  @brief The default Non-Maskable Interrupt Handler.
 *         The watch dog timeout callback function will be called
 *         for the NMI is triggered by the watch dog timeout event.
 *
 *  @returns void
 */
#if !defined(CONFIG_BUILD_NONSECURE)
SECTION_VECTOR_TEXT
void NMI_Handler(void)
{
	VNDR_S_TypeDef *vendor_s = VNDR_S;
	if ((vendor_s->VNDR_S_REG_SECURE_WATCH_DOG_TIMER & VNDR_S_BIT_WDT_TO) == VNDR_S_BIT_WDT_TO) {
		vendor_s->VNDR_S_REG_SECURE_WATCH_DOG_TIMER &= ~(VNDR_S_BIT_WDT_EN_BYTE); // disable WDT
		vendor_s->VNDR_S_REG_SECURE_WATCH_DOG_TIMER |= VNDR_S_SHIFT_WDT_CLEAR; // clear timer
		vendor_s->VNDR_S_REG_SECURE_WATCH_DOG_TIMER |= VNDR_S_BIT_WDT_TO; // clear timeout flag
		if (pwdt_adapter.wdt_handler != NULL) {
			(pwdt_adapter.wdt_handler)(pwdt_adapter.wdt_arg);
		} else {
			dbg_printf("No handler for WDT Timeout\r\n");
		}
	} else {
		if (pwdt_adapter.nmi_handler != NULL) {
			(pwdt_adapter.nmi_handler)(pwdt_adapter.nmi_arg);
		} else {
			dbg_printf("No handler for NMI\r\n");
		}
	}
#if 0
	VNDR_S_TYPE_TypeDef *vendor_s = VNDR_S;

