swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/cmsis/rtl8735b/lib/source/rom/rtl8735b_irq.c
	if (pwdt_adapter == NULL) {
		DBG_MISC_ERR("No handler for NMI\r\n");
		return;
	}
	if ((vendor_s->VNDR_S_REG_SECURE_WATCH_DOG_TIMER & VNDR_S_BIT_WDT_TO) == VNDR_S_BIT_WDT_TO) {
		vendor_s->VNDR_S_REG_SECURE_WATCH_DOG_TIMER &= ~(VNDR_S_BIT_WDT_EN_BYTE); // disable WDT
		vendor_s->VNDR_S_REG_SECURE_WATCH_DOG_TIMER |= VNDR_S_SHIFT_WDT_CLEAR; // clear timer
		vendor_s->VNDR_S_REG_SECURE_WATCH_DOG_TIMER |= VNDR_S_BIT_WDT_TO; // clear timeout flag
		if (pwdt_adapter->wdt_handler != NULL) {
			(pwdt_adapter->wdt_handler)(pwdt_adapter->wdt_arg);
		} else {
			DBG_MISC_ERR("No handler for WDT Timeout\r\n");
		}
	} else {
		if (pwdt_adapter->nmi_handler != NULL) {
			(pwdt_adapter->nmi_handler)(pwdt_adapter->nmi_arg);
		} else {
			DBG_MISC_ERR("No handler for NMI\r\n");
		}
	}
#endif
}
#endif

/**
 *  @brief Parse the CFSR(Configurable Fault Status Register)
 *         and print out the error message for the fault handler.
 *
 *  @returns    void
 */
SECTION_VECTOR_TEXT
void parse_cfsr(uint32_t cfsr)
{
	dbg_printf("SCB Configurable Fault Status Reg = 0x%08x\r\n", cfsr);
	if (cfsr & (0xFFFF << 16)) {
		dbg_printf("\r\nUsage Fault Status: \r\n");
		if (cfsr & SCB_CFSR_DIVBYZERO_Msk) {
			dbg_printf("Divide by zero UsageFault\r\n");
		}

		if (cfsr & SCB_CFSR_UNALIGNED_Msk) {
			dbg_printf("Unaligned access UsageFault\r\n");
		}

		if (cfsr & SCB_CFSR_STKOF_Msk) {
			dbg_printf("Stack overflow UsageFault\r\n");
		}

		if (cfsr & SCB_CFSR_NOCP_Msk) {
			dbg_printf("No coprocessor UsageFault. The processor does not support coprocessor instructions.\r\n");
		}

		if (cfsr & SCB_CFSR_INVPC_Msk) {
			dbg_printf("Invalid PC load UsageFault, caused by an invalid PC load by EXC_RETURN.\r\n");
		}

		if (cfsr & SCB_CFSR_INVSTATE_Msk) {
			dbg_printf("Invalid state UsageFault, the processor has attempted to execute an instruction that makes illegal use of the EPSR\r\n");
		}

		if (cfsr & SCB_CFSR_UNDEFINSTR_Msk) {
			dbg_printf("Undefined instruction UsageFault\r\n");
		}
	}

	if (cfsr & (0xFF << 8)) {
		dbg_printf("\r\nBus Fault Status: \r\n");
		if (cfsr & SCB_CFSR_BFARVALID_Msk) {
			dbg_printf("BusFault Address Reg = 0x%08x\r\n", SCB->BFAR);
		} else {
			dbg_printf("BusFault Address Reg is invalid(Asyn. BusFault)\r\n");
		}

		if (cfsr & SCB_CFSR_LSPERR_Msk) {
			dbg_printf("BusFault occurred during floating-point lazy state preservation\r\n");
		}

		if (cfsr & SCB_CFSR_STKERR_Msk) {
			dbg_printf("BusFault on stacking for exception entry\r\n");
		}

		if (cfsr & SCB_CFSR_UNSTKERR_Msk) {
			dbg_printf("BusFault on unstacking for a return from exception\r\n");
		}

		if (cfsr & SCB_CFSR_IMPRECISERR_Msk) {
			/* This is an asynchronous fault. Therefore, if it is detected when the priority of the current
			   process is higher than the BusFault priority, the BusFault becomes pending and becomes active
			   only when the processor returns from all higher priority processes.
			   If a precise fault occurs before the processor enters the handler for the imprecise BusFault,
			   the handler detects both IMPRECISERR set to 1 and one of the precise fault status bits set to 1.*/
			dbg_printf("Imprecise data bus error:\r\n");
			dbg_printf("a data bus error has occurred, but the return address in the stack frame is not related to the instruction that caused the error.\r\n");
		}

		if (cfsr & SCB_CFSR_PRECISERR_Msk) {
			dbg_printf("Precise data bus error: BFAR = 0x%08x\r\n", SCB->BFAR);
		}

		if (cfsr & SCB_CFSR_IBUSERR_Msk) {
			dbg_printf("Instruction bus error\r\n");
		}
	}

	if (cfsr & 0xFF) {
		dbg_printf("\r\nMemManage Fault Status: \r\n");
		if (cfsr & SCB_CFSR_MMARVALID_Msk) {
			dbg_printf("MemManage Fault Address Reg = 0x%08x\r\n", SCB->MMFAR);
		} else {
			dbg_printf("MemManage Fault Address Reg is invalid\r\n");
		}

		if (cfsr & SCB_CFSR_MLSPERR_Msk) {
			dbg_printf("MemManage fault occurred during floating-point lazy state preservation\r\n");
		}

		if (cfsr & SCB_CFSR_MSTKERR_Msk) {
			dbg_printf("MemManage fault on stacking for exception entry\r\n");
		}

		if (cfsr & SCB_CFSR_MUNSTKERR_Msk) {
			dbg_printf("MemManage fault on unstacking for a return from exception\r\n");
		}

		if (cfsr & SCB_CFSR_DACCVIOL_Msk) {
			dbg_printf("Data access violation: the processor attempted a load or store at a location that does not permit the operation.\r\n");
		}

		if (cfsr & SCB_CFSR_IACCVIOL_Msk) {
			dbg_printf("Instruction access violation: the processor attempted an instruction fetch from a location that does not permit execution.\r\n");
		}
	}

}

/**
 *  @brief The default hard fault interrupt handler.
 *         It will print out the stack contents and the fault status registers.
 *
 *  @returns    void
 */
SECTION_VECTOR_TEXT
void hard_fault_handler_c(uint32_t mstack[], uint32_t pstack[], uint32_t lr_value, uint32_t fault_id)
{
#if 1
	uint32_t ret, i, src, *stack;
	uint32_t xpsr = __get_xPSR();
	uint32_t CFSR, HFSR, DFSR, MMFAR, BFAR, AFSR;
	// Todo: after dev_lfc define
	//efuse_dev_lfc_state_t dev_lfc_state;

	enum { r0 = 0, r1, r2, r3, r12, lr, pc, psr};
	enum { r4 = 0, r5, r6, r7, r8, r9, r10, r11};

	/*
	    0xE000ED28 CFSR Configurable Fault Status Register
	    0xE000ED28 MMFSR MemManage Fault Status Register
	    0xE000ED29 BFSR BusFault Status Register
	    0xE000ED2A UFSR UsageFault Status Register
	    0xE000ED2C HFSR HardFault Status Register
	    0xE000ED30 DFSR Debug Fault Status Register
	    0xE000ED34 MMFAR MemManage Fault Address Register
	    0xE000ED38 BFAR BusFault Address Register
	    0xE000ED3C AFSR Auxiliary Fault Status Register

	    0xE002ED28 CFSR_NS Configurable Fault Status Register (NS)
	    0xE002ED28 MMFSR_NS MemManage Fault Status Register (NS)
	    0xE002ED29 BFSR_NS BusFault Status Register (NS)
	    0xE002ED2A UFSR_NS UsageFault Status Register (NS)
	    0xE002ED2C HFSR_NS HardFault Status Register (NS)
	    0xE002ED30 DFSR_NS Debug Fault Status Register (NS)
	    0xE002ED34 MMFAR_NS MemManage Fault Address Register (NS)
	    0xE002ED38 BFAR_NS BusFault Address Register (NS)
	    0xE002ED3C AFSR_NS Auxiliary Fault Status Register (NS
	*/
	CFSR  = SCB->CFSR;
	HFSR  = SCB->HFSR;
	DFSR  = SCB->DFSR;
	MMFAR = SCB->MMFAR;
	BFAR  = SCB->BFAR;
	AFSR  = SCB->AFSR;

#if !defined (CONFIG_BUILD_NONSECURE)
	if (_stdio_port.adapter == NULL) {
		stdio_uart_port_init();
		ConfigDebugErr = 0xFFFFFFFF;
	}
#endif
	if ((lr_value & 0x04) == 0) {
		stack = mstack + 8;     // since we pushed R4 ~ R11 in MSP
	} else {
		stack = pstack;
	}
#if 0
#if !defined (CONFIG_BUILD_NONSECURE)
	efuse_life_cycle_state_read((uint8_t *)&dev_lfc_state.byte);
#else
	dev_lfc_state.byte = 0xFF;
#endif

	if (dev_lfc_state.bit.dev_lfc_state != LfC_Deployed) {
#if !defined (CONFIG_BUILD_NONSECURE)
		dbg_printf("\r\nS-Domain Fault Handler: msp=0x%08x psp=0x%08x lr=0x%08x fault_id=%u\r\n",
				   (uint32_t)mstack, (uint32_t)pstack, lr_value, fault_id);
#else
		dbg_printf("\r\nNS-Domain Fault Handler: msp=0x%08x psp=0x%08x lr=0x%08x fault_id=%u\r\n",
				   (uint32_t)mstack, (uint32_t)pstack, lr_value, fault_id);
#endif
	}
#endif
	if (fault_id == 0) {
		dbg_printf("\r\nHard Fault: \r\n");
		dbg_printf("HardFault Status Reg = 0x%08x\r\n", HFSR);
		if (HFSR & SCB_HFSR_FORCED_Msk) {
			// forced HardFault
			/* When this bit is set to 1, the HardFault handler must read the other
			   fault status registers to find the cause of the fault. */
			dbg_printf("Forced HardFault\r\n");
			dbg_printf("SCB Configurable Fault Status Reg = 0x%08x\r\n", CFSR);
		}

		if (HFSR & SCB_HFSR_VECTTBL_Msk) {
			// Indicates a BusFault on a vector table read during exception processing
			/* When this bit is set to 1, the PC value stacked for the exception return points to
			   the instruction that was preempted by the exception.*/
			dbg_printf("BusFault on vector table read\r\n");
		}
	} else if (fault_id == 1) {
		dbg_printf("\r\nUsage Fault: \r\n");
	} else if (fault_id == 2) {
		dbg_printf("\r\nBus Fault: \r\n");
	} else if (fault_id == 3) {
		dbg_printf("\r\nMemManage Fault: \r\n");
	} else if (fault_id == 4) {
		dbg_printf("\r\nSecurity Fault: \r\n");
	} else {
		dbg_printf("\r\nDefault Hard Fault: \r\n");
	}
	parse_cfsr(CFSR);
#if 0
	if (dev_lfc_state.bit.dev_lfc_state == LfC_Deployed) {
		while (1);
	}
#endif
	if ((lr_value & BIT0) == 0) {
		dbg_printf("\r\nNS-domain exception ");
	} else {
		dbg_printf("\r\nS-domain exception ");
	}

	if ((lr_value & BIT3) == 0) {
		dbg_printf("from Handler mode, ");
	} else {
		dbg_printf("from Thread mode, ");
	}

	if ((lr_value & BIT4) == 0) {
		dbg_printf("Extended Stack frame on");
	} else {
		dbg_printf("Standard Stack frame on");
	}

	if ((lr_value & BIT6) == 0) {
		dbg_printf(" NS-");
#if !defined (CONFIG_BUILD_NONSECURE)
		if ((lr_value & 0x04) == 0) {
			stack = (uint32_t *)(__TZ_get_MSP_NS());
		} else {
			stack = (uint32_t *)(__TZ_get_PSP_NS());
		}
#endif
	} else {
		dbg_printf(" S-");
	}

	if ((lr_value & BIT2) == 0) {
		dbg_printf("MSP\r\n");
	} else {
		dbg_printf("PSP\r\n");
	}

