swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/cmsis/rtl8735b/lib/source/rom/rtl8735b_irq.c
	if ((lr_value & BIT5) == 0) {
		dbg_printf("Registers Stacking Skiped\r\n\r\n");
	} else {
		dbg_printf("Registers Saved to stack\r\n\r\n");
	}

	dbg_printf("Stacked: \r\n");
	dbg_printf("R0  = 0x%08x\r\n", stack[r0]);
	dbg_printf("R1  = 0x%08x\r\n", stack[r1]);
	dbg_printf("R2  = 0x%08x\r\n", stack[r2]);
	dbg_printf("R3  = 0x%08x\r\n", stack[r3]);

	// we stacked R4 ~ R11 in the exception handler
	dbg_printf("R4  = 0x%08x\r\n", mstack[r4]);
	dbg_printf("R5  = 0x%08x\r\n", mstack[r5]);
	dbg_printf("R6  = 0x%08x\r\n", mstack[r6]);
	dbg_printf("R7  = 0x%08x\r\n", mstack[r7]);
	dbg_printf("R8  = 0x%08x\r\n", mstack[r8]);
	dbg_printf("R9  = 0x%08x\r\n", mstack[r9]);
	dbg_printf("R10 = 0x%08x\r\n", mstack[r10]);
	dbg_printf("R11 = 0x%08x\r\n", mstack[r11]);
	mstack = (uint32_t *)((uint32_t)mstack + 0x20); // recover stack pointer for we pushed R4 ~ R11

	dbg_printf("R12 = 0x%08x\r\n", stack[r12]);
	dbg_printf("LR  = 0x%08x\r\n", stack[lr]);
	dbg_printf("PC  = 0x%08x\r\n", stack[pc]);
	dbg_printf("PSR = 0x%08x\r\n", stack[psr]);

	dbg_printf("\r\nCurrent: \r\n");
	dbg_printf("LR   = 0x%08x\r\n", lr_value);
	dbg_printf("MSP  = 0x%08x\r\n", mstack);
	dbg_printf("PSP  = 0x%08x\r\n", pstack);
	dbg_printf("xPSR = 0x%08x\r\n", xpsr);

#if !defined (CONFIG_BUILD_NONSECURE)
	dbg_printf("CFSR  = 0x%08x\r\n", CFSR);
	dbg_printf("HFSR  = 0x%08x\r\n", HFSR);
	dbg_printf("DFSR  = 0x%08x\r\n", DFSR);
	dbg_printf("MMFAR = 0x%08x\r\n", MMFAR);
	dbg_printf("BFAR  = 0x%08x\r\n", BFAR);
	dbg_printf("AFSR  = 0x%08x\r\n", AFSR);
#else
	dbg_printf("CFSR_NS  = 0x%08x\r\n", CFSR);
	dbg_printf("HFSR_NS  = 0x%08x\r\n", HFSR);
	dbg_printf("DFSR_NS  = 0x%08x\r\n", DFSR);
	dbg_printf("MMFAR_NS = 0x%08x\r\n", MMFAR);
	dbg_printf("BFAR_NS  = 0x%08x\r\n", BFAR);
	dbg_printf("AFSR_NS  = 0x%08x\r\n", AFSR);
#endif
	ret = __get_PRIMASK();
	dbg_printf("PriMask = 0x%08x\r\n", ret);
//    ret = __get_BASEPRI();
//    dbg_printf("BasePri 0x%08x\r\n", ret);
	dbg_printf("SVC priority: 0x%02x\r\n", HAL_READ8(0xE000ED1F, 0));
	dbg_printf("PendSVC priority: 0x%02x\r\n", HAL_READ8(0xE000ED22, 0));
	dbg_printf("Systick priority: 0x%02x\r\n", HAL_READ8(0xE000ED23, 0));

	dbg_printf("\r\nMSP Data:\r\n");
	src = (uint32_t)mstack;
	for (i = 0; i < 64; i += 4, src += 16) {
		if (*(u32 *)(src) == 0xDEADBEEF) {
			break;
		}
		dbg_printf("%08X:    %08X", src, *(u32 *)(src));
		dbg_printf("    %08X", *(u32 *)(src + 4));
		dbg_printf("    %08X", *(u32 *)(src + 8));
		dbg_printf("    %08X\r\n", *(u32 *)(src + 12));
	}

	src = (uint32_t)pstack;
	if (src != 0) {
		dbg_printf("\r\nPSP Data:\r\n");
		for (i = 0; i < 64; i += 4, src += 16) {
			dbg_printf("%08X:    %08X", src, *(u32 *)(src));
			dbg_printf("    %08X", *(u32 *)(src + 4));
			dbg_printf("    %08X", *(u32 *)(src + 8));
			dbg_printf("    %08X\r\n", *(u32 *)(src + 12));
		}
	}

#if !defined (CONFIG_BUILD_NONSECURE)
#if  (__ARM_FEATURE_CMSE == 3U)
	if (((SCB->AIRCR & SCB_AIRCR_BFHFNMINS_Msk) == 0) || (fault_id == 4)) {
		// BusFault, HardFault & NMI handler are in secure state or in SecureFault
		uint32_t CFSR_NS, HFSR_NS, DFSR_NS, MMFAR_NS, BFAR_NS, AFSR_NS;
		uint32_t MSP_NS, PSP_NS;

		CFSR_NS  = SCB_NS->CFSR;
		HFSR_NS  = SCB_NS->HFSR;
		DFSR_NS  = SCB_NS->DFSR;
		MMFAR_NS = SCB_NS->MMFAR;
		BFAR_NS  = SCB_NS->BFAR;
		AFSR_NS  = SCB_NS->AFSR;

		MSP_NS = __TZ_get_MSP_NS();
		PSP_NS = __TZ_get_PSP_NS();
		dbg_printf("\r\n == NS Dump ==\r\n", CFSR_NS);
		dbg_printf("CFSR_NS  = 0x%08x\r\n", CFSR_NS);
		dbg_printf("HFSR_NS  = 0x%08x\r\n", HFSR_NS);
		dbg_printf("DFSR_NS  = 0x%08x\r\n", DFSR_NS);
		dbg_printf("MMFAR_NS = 0x%08x\r\n", MMFAR_NS);
		dbg_printf("BFAR_NS  = 0x%08x\r\n", BFAR_NS);
		dbg_printf("AFSR_NS  = 0x%08x\r\n", AFSR_NS);

		dbg_printf("MSP_NS   = 0x%08x\r\n", MSP_NS);
		dbg_printf("PSP_NS   = 0x%08x\r\n", PSP_NS);

		dbg_printf("NS HardFault Status Reg = 0x%08x\r\n", HFSR_NS);
		if (HFSR_NS & SCB_HFSR_FORCED_Msk) {
			// forced HardFault
			/* When this bit is set to 1, the HardFault handler must read the other
			   fault status registers to find the cause of the fault. */
			dbg_printf("Forced HardFault\r\n");
			dbg_printf("SCB Configurable Fault Status Reg = 0x%08x\r\n", HFSR_NS);
		}

		if (HFSR_NS & SCB_HFSR_VECTTBL_Msk) {
			// Indicates a BusFault on a vector table read during exception processing
			/* When this bit is set to 1, the PC value stacked for the exception return points to
			   the instruction that was preempted by the exception.*/
			dbg_printf("NS BusFault on vector table read\r\n");
		}

		parse_cfsr(CFSR_NS);

		if (MSP_NS != 0) {
			dbg_printf("\r\nNS MSP Data:\r\n");
			src = (uint32_t)MSP_NS;
			for (i = 0; i < 64; i += 4, src += 16) {
				dbg_printf("%08X:    %08X", src, *(u32 *)(src));
				dbg_printf("    %08X", *(u32 *)(src + 4));
				dbg_printf("    %08X", *(u32 *)(src + 8));
				dbg_printf("    %08X\r\n", *(u32 *)(src + 12));
			}
		}

		if (PSP_NS != 0) {
			dbg_printf("\r\nNS PSP Data:\r\n");
			src = (uint32_t)PSP_NS;
			for (i = 0; i < 64; i += 4, src += 16) {
				dbg_printf("%08X:    %08X", src, *(u32 *)(src));
				dbg_printf("    %08X", *(u32 *)(src + 4));
				dbg_printf("    %08X", *(u32 *)(src + 8));
				dbg_printf("    %08X\r\n", *(u32 *)(src + 12));
			}
		}
	}
#endif
	if ((lr_value & BIT6) == 0) {
		stack_trace_back((__TZ_get_MSP_NS()), (__TZ_get_PSP_NS()), lr_value, 1);
	} else {
		stack_trace_back((uint32_t)mstack, (uint32_t)pstack, lr_value, 0);
	}
#else
	stack_trace_back((uint32_t)mstack, (uint32_t)pstack, lr_value, 0);
#endif

	if (CoreDebug->DHCSR & 0x01) {
		// Debugger Connected
		__BKPT(0);      // Halt program here
	}
	while (1);
#endif
}

/**
 *  @brief Initials the RAM base interrupt vector table and configure the NVIC to use this table.
 *         It copys the old vector table to the new vector table.
 *
 *  @param[in]  stack_ptr The stack pointer. As the Cortex-m spec,
 *                        this value must be filled to the start of the vector table.
 *
 *  @param[in]  vector_tbl The vector table.
 *
 *  @returns    void
 */
SECTION_VECTOR_TEXT
void hal_rtl_vector_table_init(uint32_t stack_ptr, int_vector_t *vector_tbl)
{
	u32 i = 0;
#if defined (CONFIG_BUILD_NONSECURE)
	int_vector_t *old_vector_table = (int_vector_t *)&__Vectors_NS;
#else
	int_vector_t *old_vector_table = (int_vector_t *)&__Vectors;
#endif

	// Initial new stack point
	vector_tbl[0] = (int_vector_t)stack_ptr;

#if !defined (CONFIG_BUILD_NONSECURE)
	// Initial new reset function
	vector_tbl[1] = old_vector_table[1];
#endif

	// copy vector table from ROM
	for (i = 2; i < MAX_SYSTEM_IRQ_NUM; i++) {
		vector_tbl[i] = old_vector_table[i];
	}

	old_vector_table = (int_vector_t *)(SCB->VTOR);
	for (i = 0; i < MAX_PERIPHERAL_IRQ_NUM; i++) {
		vector_tbl[16 + i] = old_vector_table[16 + i];
	}

	SCB_CleanDCache_by_Addr((uint32_t *)vector_tbl, (MAX_VECTOR_TABLE_NUM * 4));
	__DMB();
	SCB->VTOR = (uint32_t)vector_tbl;
	__ISB();
}

SECTION_VECTOR_TEXT
void _default_handler(void)
{
	dbg_printf("\r\n[ UnHandle IRQ ]\r\n");
	dbg_printf("ISER = 0x%08x\r\n", NVIC->ISER[0]);
	dbg_printf("ISPR = 0x%08x\r\n", NVIC->ISPR[0]);
	dbg_printf("IABR = 0x%08x\r\n", NVIC->IABR[0]);
	dbg_printf("xPSR = 0x%08x\r\n", __get_xPSR());
	while (1);
}

/**
  \brief   Enable Interrupt
  \details Enables a device specific interrupt in the NVIC interrupt controller.
  \param [in]      irqn  Device specific interrupt number.
  \note    irqn must not be negative.
 */
SECTION_VECTOR_TEXT
void _irq_enable(int32_t irqn)
{
	__NVIC_EnableIRQ(irqn);
}

/**
  \brief   Disable Interrupt
  \details Disables a device specific interrupt in the NVIC interrupt controller.
  \param [in]      irqn  Device specific interrupt number.
  \note    irqn must not be negative.
 */
SECTION_VECTOR_TEXT
void _irq_disable(int32_t irqn)
{
	__NVIC_DisableIRQ(irqn);
}

/**
  \brief   Set Interrupt Vector
  \details Sets an interrupt vector in SRAM based interrupt vector table.
           The interrupt number can be positive to specify a device specific interrupt,
           or negative to specify a processor exception.
           VTOR must been relocated to SRAM before.
  \param [in]   irqn      Interrupt number
  \param [in]   vector    Address of interrupt handler function
 */
SECTION_VECTOR_TEXT
void _irq_set_vector(int32_t irqn, uint32_t vector)
{
	__NVIC_SetVector(irqn, vector);
}

/**
  \brief   Get Interrupt Vector
  \details Reads an interrupt vector from interrupt vector table.
           The interrupt number can be positive to specify a device specific interrupt,
           or negative to specify a processor exception.
  \param [in]   irqn      Interrupt number.
  \return                 Address of interrupt handler function
 */
SECTION_VECTOR_TEXT
uint32_t _irq_get_vector(int32_t irqn)
{
	return __NVIC_GetVector(irqn);
}

/**
  \brief   Set Interrupt Priority
  \details Sets the priority of a device specific interrupt or a processor exception.
           The interrupt number can be positive to specify a device specific interrupt,
           or negative to specify a processor exception.
  \param [in]      irqn  Interrupt number.
  \param [in]  priority  Priority to set.
  \note    The priority cannot be set for every processor exception.
 */
SECTION_VECTOR_TEXT
void _irq_set_priority(int32_t irqn, uint32_t priority)
{
	__NVIC_SetPriority(irqn, priority);
}

/**
  \brief   Get Interrupt Priority
  \details Reads the priority of a device specific interrupt or a processor exception.
           The interrupt number can be positive to specify a device specific interrupt,
           or negative to specify a processor exception.
  \param [in]   irqn  Interrupt number.
  \return             Interrupt Priority.
                      Value is aligned automatically to the implemented priority bits of the microcontroller.
 */
SECTION_VECTOR_TEXT
uint32_t _irq_get_priority(int32_t irqn)
{
	return __NVIC_GetPriority(irqn);
}

/**
  \brief   Set Pending Interrupt
  \details Sets the pending bit of a device specific interrupt in the NVIC pending register.
  \param [in]      irqn  Device specific interrupt number.
  \note    irqn must not be negative.
 */
SECTION_VECTOR_TEXT
void _irq_set_pending(int32_t irqn)
{
	__NVIC_SetPendingIRQ(irqn);
}

/**
  \brief   Get Pending Interrupt
  \details Reads the NVIC pending register and returns the pending bit for the specified device specific interrupt.
  \param [in]      irqn  Device specific interrupt number.
  \return             0  Interrupt status is not pending.
  \return             1  Interrupt status is pending.
  \note    irqn must not be negative.
 */
SECTION_VECTOR_TEXT
uint32_t _irq_get_pending(int32_t irqn)
{
	return __NVIC_GetPendingIRQ(irqn);
}

/**
  \brief   Clear Pending Interrupt
  \details Clears the pending bit of a device specific interrupt in the NVIC pending register.
  \param [in]      irqn  Device specific interrupt number.
  \note    irqn must not be negative.
 */
SECTION_VECTOR_TEXT
void _irq_clear_pending(int32_t irqn)
{
	__NVIC_ClearPendingIRQ(irqn);
}

/**
  \brief   Enable IRQ Interrupts
  \details Enables IRQ interrupts by clearing the I-bit in the CPSR.
           Can only be executed in Privileged modes.
 */
SECTION_VECTOR_TEXT
void _interrupt_enable(void)
{
	__enable_irq();
}

/**
  \brief   Disable IRQ Interrupts
  \details Disables IRQ interrupts by setting the I-bit in the CPSR.
           Can only be executed in Privileged modes.
 */
SECTION_VECTOR_TEXT
void _interrupt_disable(void)
{
	__disable_irq();
}

/**
  \brief   Hooks IRQ APIs for ROM code.
  \details Hooks a set of NVIC control functions for the ROM HAL.
  \param [in]      pirq_api  The IRQ APIs to hook.
 */
SECTION_VECTOR_TEXT
void hal_rtl_irq_api_init(hal_irq_api_t *pirq_api)
{
	pirq_api_tbl = pirq_api;
}

/**
  \brief   Enable Interrupt
  \details Enables a device specific interrupt in the NVIC interrupt controller.
  \param [in]      irqn  Device specific interrupt number.
  \note    irqn must not be negative.
 */
SECTION_VECTOR_TEXT
void hal_rtl_irq_enable(int32_t irqn)
{
	if ((!pirq_api_tbl) || (pirq_api_tbl->irq_enable == NULL)) {
		__NVIC_EnableIRQ(irqn);
	} else {
		pirq_api_tbl->irq_enable(irqn);
	}
}

/**
  \brief   Disable Interrupt
  \details Disables a device specific interrupt in the NVIC interrupt controller.
  \param [in]      irqn  Device specific interrupt number.
  \note    irqn must not be negative.
 */
SECTION_VECTOR_TEXT
void hal_rtl_irq_disable(int32_t irqn)
{
	if ((!pirq_api_tbl) || (pirq_api_tbl->irq_disable == NULL)) {
		__NVIC_DisableIRQ(irqn);
	} else {
		pirq_api_tbl->irq_disable(irqn);
	}
}

/**
  \brief   Set Interrupt Vector
  \details Sets an interrupt vector in SRAM based interrupt vector table.
           The interrupt number can be positive to specify a device specific interrupt,
           or negative to specify a processor exception.
           VTOR must been relocated to SRAM before.
  \param [in]   irqn      Interrupt number
  \param [in]   vector    Address of interrupt handler function
 */
SECTION_VECTOR_TEXT
void hal_rtl_irq_set_vector(int32_t irqn, uint32_t vector)
{
	if ((!pirq_api_tbl) || (pirq_api_tbl->irq_set_vector == NULL)) {
		__NVIC_SetVector(irqn, vector);
	} else {
		pirq_api_tbl->irq_set_vector(irqn, vector);
	}
}

/**
  \brief   Get Interrupt Vector
  \details Reads an interrupt vector from interrupt vector table.
           The interrupt number can be positive to specify a device specific interrupt,
           or negative to specify a processor exception.
  \param [in]   irqn      Interrupt number.
  \return                 Address of interrupt handler function
 */
SECTION_VECTOR_TEXT
uint32_t hal_rtl_irq_get_vector(int32_t irqn)
{
	if ((!pirq_api_tbl) || (pirq_api_tbl->irq_get_vector == NULL)) {
		return __NVIC_GetVector(irqn);
	} else {
		return pirq_api_tbl->irq_get_vector(irqn);
	}
}

/**
  \brief   Set Interrupt Priority
  \details Sets the priority of a device specific interrupt or a processor exception.
           The interrupt number can be positive to specify a device specific interrupt,
           or negative to specify a processor exception.
  \param [in]      irqn  Interrupt number.
  \param [in]  priority  Priority to set.
  \note    The priority cannot be set for every processor exception.
 */
SECTION_VECTOR_TEXT
void hal_rtl_irq_set_priority(int32_t irqn, uint32_t priority)
{
	if ((!pirq_api_tbl) || (pirq_api_tbl->irq_set_priority == NULL)) {
		__NVIC_SetPriority(irqn, priority);
	} else {
		pirq_api_tbl->irq_set_priority(irqn, priority);
	}
}

/**
  \brief   Get Interrupt Priority
  \details Reads the priority of a device specific interrupt or a processor exception.
           The interrupt number can be positive to specify a device specific interrupt,
           or negative to specify a processor exception.
  \param [in]   irqn  Interrupt number.
  \return             Interrupt Priority.
                      Value is aligned automatically to the implemented priority bits of the microcontroller.
 */
SECTION_VECTOR_TEXT
uint32_t hal_rtl_irq_get_priority(int32_t irqn)
{
	if ((!pirq_api_tbl) || (pirq_api_tbl->irq_get_priority == NULL)) {
		return __NVIC_GetPriority(irqn);
	} else {
		return pirq_api_tbl->irq_get_priority(irqn);
	}
}

/**
  \brief   Set Pending Interrupt
  \details Sets the pending bit of a device specific interrupt in the NVIC pending register.
  \param [in]      irqn  Device specific interrupt number.
  \note    IRQn must not be negative.
 */
SECTION_VECTOR_TEXT
void hal_rtl_irq_set_pending(int32_t irqn)
{
	if ((!pirq_api_tbl) || (pirq_api_tbl->irq_set_pending == NULL)) {
		__NVIC_SetPendingIRQ(irqn);
	} else {
		pirq_api_tbl->irq_set_pending(irqn);
	}
}

/**
  \brief   Get Pending Interrupt
  \details Reads the NVIC pending register and returns the pending bit for the specified device specific interrupt.
  \param [in]      irqn  Device specific interrupt number.
  \return             0  Interrupt status is not pending.
  \return             1  Interrupt status is pending.
  \note    irqn must not be negative.
 */
SECTION_VECTOR_TEXT
uint32_t hal_rtl_irq_get_pending(int32_t irqn)
{
	if ((!pirq_api_tbl) || (pirq_api_tbl->irq_get_pending == NULL)) {
		return __NVIC_GetPendingIRQ(irqn);
	} else {
		return pirq_api_tbl->irq_get_pending(irqn);
	}
}

/**
  \brief   Clear Pending Interrupt
  \details Clears the pending bit of a device specific interrupt in the NVIC pending register.
  \param [in]      irqn  Device specific interrupt number.
  \note    irqn must not be negative.
 */
SECTION_VECTOR_TEXT
void hal_rtl_irq_clear_pending(int32_t irqn)
{
	if ((!pirq_api_tbl) || (pirq_api_tbl->irq_clear_pending == NULL)) {
		__NVIC_ClearPendingIRQ(irqn);
	} else {
		pirq_api_tbl->irq_clear_pending(irqn);
	}
}

/**
  \brief   Un-registers a interrupt vector.
  \details Disables a device specific interrupt in the NVIC interrupt controller.
           And set its interrupt vector to the default interrupt handler.
  \param [in]      irqn  Device specific interrupt number.
  \note    irqn must not be negative.
 */
SECTION_VECTOR_TEXT
void hal_rtl_irq_unreg(int32_t irqn)
{
	hal_rtl_irq_disable(irqn);
	__ISB();
	hal_rtl_irq_set_vector(irqn, (uint32_t)_default_handler);
}

/**
  \brief   Enable IRQ Interrupts
  \details Enables IRQ interrupts by clearing the I-bit in the CPSR.
           Can only be executed in Privileged modes.
 */
SECTION_VECTOR_TEXT
void hal_rtl_interrupt_enable(void)
{
	if ((!pirq_api_tbl) || (pirq_api_tbl->interrupt_enable == NULL)) {
		__enable_irq();
	} else {
		pirq_api_tbl->interrupt_enable();
	}
}

/**
  \brief   Disable IRQ Interrupts
  \details Disables IRQ interrupts by setting the I-bit in the CPSR.
           Can only be executed in Privileged modes.
 */
SECTION_VECTOR_TEXT
void hal_rtl_interrupt_disable(void)
{
	if ((!pirq_api_tbl) || (pirq_api_tbl->interrupt_disable == NULL)) {
		__disable_irq();
	} else {
		pirq_api_tbl->interrupt_disable();
	}
}

#define IN_RANGE(addr, low, high) ((((uint32_t)addr)>=((uint32_t)low))&&(((uint32_t)addr)<((uint32_t)high)))
/**
  \brief        Checks if the given address in the memory range of text code.
  \param [in]   arrd  The address for the cheching.
  \return       true: the given address is located in the text range.
  \return       false: the given address is NOT located in the text range or no text range list.
 */
SECTION_VECTOR_TEXT
BOOLEAN check_in_text_area(uint32_t addr)
{
	uint32_t *range_start;
	uint32_t *range_end;
	uint32_t *ptxt_range_list;

	if ((pfault_back_trace != NULL) && (pfault_back_trace->ptxt_range_list != NULL)) {
		ptxt_range_list = pfault_back_trace->ptxt_range_list;
		range_start = (uint32_t *)(*ptxt_range_list);
		range_end = (uint32_t *)(*(ptxt_range_list + 1));
		while ((uint32_t)range_start != 0xFFFFFFFFUL) {
			if ((uint32_t)range_end > (uint32_t)range_start) {
				if (IN_RANGE(addr, range_start, range_end)) {
					return TRUE;
				}
			}
			ptxt_range_list += 2;
			range_start = (uint32_t *)(*ptxt_range_list);
			range_end = (uint32_t *)(*(ptxt_range_list + 1));
		}

		return FALSE;
	} else {
		return FALSE;
	}
}

SECTION_VECTOR_TEXT
static void store_trace_back_sp_offset(uint32_t idx, uint32_t *pbuf, uint32_t offset)
{
	if (pbuf != NULL) {
		*(pbuf + idx) = offset;
	}
}

/**
  \brief        To trace back the stack and list out the in-stack content which could be a text code address.
  \param [in]   msp  The main stack pointer.
  \param [in]   psp  The process mode stack pointer.
  \param [in]   fault_lr  The LR register value for current hard fault handler.
  \param [in]   trace_ns  The flag to indicates trace NS stack from S domain.
  \return       void.
 */
#if !defined(CONFIG_BUILD_NONSECURE)

SECTION_VECTOR_TEXT
void stack_trace_back(uint32_t msp, uint32_t psp, uint32_t fault_lr, uint32_t trace_ns)
{
	uint32_t stack_top;
	uint32_t stack_lim;
	uint32_t sp;
	uint32_t *sp_ptr;
	uint32_t lr;
	uint32_t pc;
	uint32_t *trace_buffer;
	uint32_t *offset_buffer;
	uint32_t trace_idx = 0;
	uint32_t *sp_offset;
	uint32_t from_int = 0;
	uint32_t i;
	fault_handler_back_trace_t *pback_trace;
	uint32_t trace_loop;
//    uint32_t loop_i;

#if defined(CONFIG_BUILD_SECURE) && (CONFIG_BUILD_SECURE == 1)
	if (trace_ns) {
		pback_trace = pfault_back_trace_ns;
	} else {
		pback_trace = pfault_back_trace;
	}
#else
	pback_trace = pfault_back_trace;
#endif

