swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/cmsis/rtl8735b/lib/source/rom/rtl8735b_irq.c
	if ((pback_trace == NULL) || (pback_trace->ptrace_buf == NULL)) {
		dbg_printf("No Back Trace!\r\n");
		return;
	}

	if (trace_ns && psp != 0) {
		// trace NS stack: for both MS & PS
		trace_loop = 2;
	} else {
		// trace only MS or PS
		trace_loop = 1;
	}

	dbg_printf("\n\r== Back Trace ==\n\r\n\r");
	dbg_printf("msp=0x%08x psp=0x%08x\r\n", msp, psp);

	do {

		trace_buffer = pback_trace->ptrace_buf;
		offset_buffer = pback_trace->poffset_buf;
		_memset((void *)trace_buffer, 0, sizeof(uint32_t) * pback_trace->trace_depth);

		do {
			/* SPSEL, bit [2]
			   Stack pointer selection. Indicates which stack pointer the exception frame resides on.
			   The possible values of this bit are:
			   0 Main stack pointer.
			   1 Process stack pointer
			*/
			if (!trace_ns) {
				if ((fault_lr & BIT2) != 0) {
					// use PSP
					sp = psp;
					stack_lim = sp;
					stack_top = sp + pback_trace->ps_max_size;
					sp_ptr = &psp;
					dbg_printf("Process stack back trace:\n\r");
				} else {
					// use MSP
					stack_top = pback_trace->msp_top;
					stack_lim = pback_trace->msp_limit;
					sp = msp;
					sp_ptr = &msp;
					dbg_printf("Main stack back trace:\n\r");
				}
			} else {
				if ((trace_loop > 1) || (psp == 0)) {
					// trace MS
					stack_top = pback_trace->msp_top;
					stack_lim = pback_trace->msp_limit;
					sp = msp;
					sp_ptr = &msp;
					dbg_printf("Main stack back trace:\n\r");
				} else {
					// trace PS
					sp = psp;
					stack_lim = sp;
					stack_top = sp + pback_trace->ps_max_size;
					sp_ptr = &psp;
					dbg_printf("Process stack back trace:\n\r");
				}
			}
			dbg_printf("top=0x%08x lim=0x%08x\r\n", stack_top, stack_lim);

			/* DCRS, bit [5]
			   Default callee register stacking. Indicates whether the default stacking rules apply, or whether the
			   callee registers are already on the stack.
			   The possible values of this bit are:
			   0 Stacking of the callee saved registers skipped.
			   1 Default rules for stacking the callee registers followed
			*/
			if ((fault_lr & BIT5) != 0) {
				lr = *((uint32_t *)(sp + 20));
				pc = *((uint32_t *)(sp + 24));
				if ((fault_lr & BIT4) != 0) {
					//standard stacking format
					sp += (8 * 4);
					*sp_ptr += (8 * 4);
				} else {
					//extend stacking format
					sp += (26 * 4);
					*sp_ptr += (26 * 4);
				}

				store_trace_back_sp_offset(trace_idx, offset_buffer, 0);
				trace_buffer[trace_idx++] = pc;
				store_trace_back_sp_offset(trace_idx, offset_buffer, 0);
				trace_buffer[trace_idx++] = lr - 4;

				if (((lr & 0xFFFFFF00) == 0xFFFFFF00) && ((lr & BIT3) == 0)) {
					// stacked from a hard fault handler
					fault_lr = lr;
					from_int = 1;
				} else {
					from_int = 0;
				}
			}
		} while (from_int != 0);

		sp_offset = (uint32_t *)sp;
		while (IN_RANGE((uint32_t)sp_offset, (uint32_t)stack_lim, (uint32_t)stack_top)) {
			// check stack end
			if (*sp_offset & 0x01) {
				if (check_in_text_area(*sp_offset)) {
					store_trace_back_sp_offset(trace_idx, offset_buffer, ((uint32_t)sp_offset));
					trace_buffer[trace_idx++] = *sp_offset - 4;

					if (trace_idx >= pback_trace->trace_depth) {
						break;
					}
				}
			}
			sp_offset++;

			// maximum trace 64K
			if (((uint32_t)sp_offset - sp) > (1024 * 64)) {
				break;
			}
		}

		for (i = 0; i < trace_idx; i++) {
			if (offset_buffer == NULL) {
				dbg_printf("%08x \n\r", trace_buffer[i]);
			} else {
				dbg_printf("%08x @ sp = %08x\n\r", trace_buffer[i], offset_buffer[i]);
			}
		}

		dbg_printf("\r\nBacktrace information may not correct! Use this command to get C source level information:\r\narm-none-eabi-addr2line -e ELF_file -a -f ");
		for (i = 0; i < trace_idx; i++) {
			dbg_printf("%08x ", trace_buffer[i]);
		}
		dbg_printf("\n\r\n\r");
		trace_loop--;
		trace_idx = 0;
	} while (trace_loop > 0);

}

#else   // else of "#if !defined(CONFIG_BUILD_NONSECURE)"

SECTION_VECTOR_TEXT
void stack_trace_back(uint32_t msp, uint32_t psp, uint32_t fault_lr, uint32_t trace_ns)
{
	uint32_t stack_top;
	uint32_t stack_lim;
	uint32_t sp;
	uint32_t *sp_ptr;
	uint32_t lr;
	uint32_t pc;
	uint32_t *trace_buffer;
	uint32_t *offset_buffer;
	uint32_t trace_idx = 0;
	uint32_t *sp_offset;
	uint32_t from_int = 0;
	uint32_t i;
	fault_handler_back_trace_t *pback_trace;

	pback_trace = pfault_back_trace;

	if ((pback_trace == NULL) || (pback_trace->ptrace_buf == NULL)) {
		dbg_printf("No Back Trace!\r\n");
		return;
	}

	trace_buffer = pback_trace->ptrace_buf;
	offset_buffer = pback_trace->poffset_buf;
	_memset((void *)trace_buffer, 0, sizeof(uint32_t) * pback_trace->trace_depth);

	do {
		/* SPSEL, bit [2]
		   Stack pointer selection. Indicates which stack pointer the exception frame resides on.
		   The possible values of this bit are:
		   0 Main stack pointer.
		   1 Process stack pointer
		*/
		if ((fault_lr & BIT2) != 0) {
			// use PSP
			sp = psp;
			stack_lim = sp;
			stack_top = sp + pback_trace->ps_max_size;
			sp_ptr = &psp;
		} else {
			// use MSP
			stack_top = pback_trace->msp_top;
			stack_lim = pback_trace->msp_limit;
			sp = msp;
			sp_ptr = &msp;
		}

		/* DCRS, bit [5]
		   Default callee register stacking. Indicates whether the default stacking rules apply, or whether the
		   callee registers are already on the stack.
		   The possible values of this bit are:
		   0 Stacking of the callee saved registers skipped.
		   1 Default rules for stacking the callee registers followed
		*/
		if ((fault_lr & BIT5) != 0) {
			lr = *((uint32_t *)(sp + 20));
			pc = *((uint32_t *)(sp + 24));
			if ((fault_lr & BIT4) != 0) {
				//standard stacking format
				sp += (8 * 4);
				*sp_ptr += (8 * 4);
			} else {
				//extend stacking format
				sp += (26 * 4);
				*sp_ptr += (26 * 4);
			}

			store_trace_back_sp_offset(trace_idx, offset_buffer, 0);
			trace_buffer[trace_idx++] = pc;
			store_trace_back_sp_offset(trace_idx, offset_buffer, 0);
			trace_buffer[trace_idx++] = lr - 4;

			if (((lr & 0xFFFFFF00) == 0xFFFFFF00) && ((lr & BIT3) == 0)) {
				// stacked from a hard fault handler
				fault_lr = lr;
				from_int = 1;
			} else {
				from_int = 0;
			}
		}
	} while (from_int != 0);

	sp_offset = (uint32_t *)sp;
	while (IN_RANGE((uint32_t)sp_offset, (uint32_t)stack_lim, (uint32_t)stack_top)) {
		// check stack end
		if (*sp_offset & 0x01) {
			if (check_in_text_area(*sp_offset)) {
				store_trace_back_sp_offset(trace_idx, offset_buffer, ((uint32_t)sp_offset));
				trace_buffer[trace_idx++] = *sp_offset - 4;

				if (trace_idx >= pback_trace->trace_depth) {
					break;
				}
			}
		}
		sp_offset++;

		// maximum trace 64K
		if (((uint32_t)sp_offset - sp) > (1024 * 64)) {
			break;
		}
	}

	dbg_printf("\n\r== Back Trace ==\n\r\n\r");
	dbg_printf("msp=0x%08x psp=0x%08x top=0x%08x lim=0x%08x\r\n", msp, psp, stack_top, stack_lim);
	for (i = 0; i < trace_idx; i++) {
		if (offset_buffer == NULL) {
			dbg_printf("%08x \n\r", trace_buffer[i]);
		} else {
			dbg_printf("%08x @ sp = %08x\n\r", trace_buffer[i], offset_buffer[i]);
		}
	}

	dbg_printf("\r\nBacktrace information may not correct! Use this command to get C source level information:\r\narm-none-eabi-addr2line -e ELF_file -a -f ");
	for (i = 0; i < trace_idx; i++) {
		dbg_printf("%08x ", trace_buffer[i]);
	}
	dbg_printf("\n\r\n\r");
}
#endif      // end of else of "#if !defined(CONFIG_BUILD_NONSECURE)"
/** @} */ /* End of group hal_rtl_irq_rom_func */
/// @endcond

/** @} */ /* End of group hal_rtl_irq */

